.config/doom/config.org
#+TITLE: Alex Birdsall's doom emacs config
#+PROPERTY: header-args :noweb yes

This is my doom config. It's a literate config, so the code snippets are living documentation; they
get exported to specific init files.

At present, this /almost/ only tangles to elisp files for doom emacs to load; it also builds ~/.guile

#+begin_src elisp :tangle packages.el
<<packages-preamble>>
#+end_src
#+begin_src elisp
<<config-preamble>>
#+end_src

* work nicely with the surrounding computer
** clipboard
By default, editing stuff in emacs shouldn't pollute the system clipboard:
#+begin_src elisp
(setq! select-enable-clipboard nil)

#+end_src

Pasting from the system clipboard should be easy:
#+begin_src elisp
(map! "C-M-y" #'clipboard-yank)

#+end_src

And capturing text to it should be, too. To write this, I just copy-pasted the actual source of ~evil-yank~
and added ~select-enable-clipboard~ and ~select-enable-primary~ to the ~let~ form around the
logic:
#+begin_src elisp
(evil-define-operator evil-yank-to-clipboard (beg end type register yank-handler)
  "Save the characters in motion into the kill-ring."
  :move-point nil
  :repeat nil
  (interactive "<R><x><y>")
  (let ((evil-was-yanked-without-register
         (and evil-was-yanked-without-register (not register)))
        (select-enable-clipboard t)
        (select-enable-primary t))
    (cond
     ((and (fboundp 'cua--global-mark-active)
           (fboundp 'cua-copy-region-to-global-mark)
           (cua--global-mark-active))
      (cua-copy-region-to-global-mark beg end))
     ((eq type 'block)
      (evil-yank-rectangle beg end register yank-handler))
     ((memq type '(line screen-line))
      (evil-yank-lines beg end register yank-handler))
     (t
      (evil-yank-characters beg end register yank-handler)
      (goto-char beg)))))

(map! :map evil-normal-state-map "Y" #'evil-yank-to-clipboard)
(map! :map evil-motion-state-map "Y" #'evil-yank-to-clipboard)

#+end_src

Those are great for interactive use; now let's make programmatically adding text to the
system clipboard nice and easy, too:
#+begin_src elisp
(defun copy-to-clipboard (string)
  "Copies `STRING' to the system clipboard and the kill ring. When called interactively,
the active region will be used."
  (interactive
   (when (region-active-p)
     (list (buffer-substring-no-properties (region-beginning) (region-end)))))
  (let ((select-enable-clipboard t)
        (select-enable-primary t))
    (kill-new string)))

#+end_src

This one is just for funsies:
#+begin_src elisp
(defun copy-unicode-char-to-clipboard ()
  "Interactively select a unicode character and copy it to the system clipboard."
  (interactive)
  (with-temp-buffer
    (call-interactively #'insert-char)
    (let ((char (buffer-string)))
      (copy-to-clipboard char)
      (message "%s" (concat "Copied " char " to system clipboard")))))

#+end_src

** macOS shenanigans
this config [[https://en.wikipedia.org/wiki/Unitarian_Universalist_Association#Principles_and_purposes][covenants to affirm and promote the inherent worth and dignity]] of every computer it's installed on, even macs
I was raised by and around a bunch of earnest, wordy people; deal with it.

#+begin_src elisp
(setq! mac-command-modifier 'meta
       mac-option-modifier 'meta
       ns-function-modifier 'super)
#+end_src

*** trouble? shoot it.
Sometimes on macOS, emacs will throw a constant stream of errors that end with "Too many open files" all over itself. The solution, per [[https://www.blogbyben.com/2022/05/gotcha-emacs-on-mac-os-too-many-files.html][this blog post]]?
#+begin_src elisp :tangle no
(file-notify-rm-all-watches)
#+end_src

Also, I have had certain macOS computers on which emacs consistently has a misdefined
~woman-manpath~, which is weird! Particularly since ~(describe-variable 'woman-manpath)~
will report a functioning, correct-looking original value. If this hits you, you'll need
to reset the value in =~/.config/doom/local.el= so it's manually set correctly. Or rerun
~doom env~ on the command line in a context where ~MANPATH~ is correct. Here is a minimal
(i.e. with all nonstandard and/or versioned paths from language-specific package manager
installation locations removed) reference version:
#+begin_src elisp :tangle no
(setq! woman-manpath
       '("/opt/homebrew/share/man/"
         "/usr/share/man/"
         "/usr/local/share/man/"
         "/usr/share/man"
         "/usr/local/share/man"
         "/usr/X11/man"
         "/Library/Apple/usr/share/man"))
#+end_src

** better terminal keycode handling
Leaving the untangled manual config in place for a bit so things work with my computers
which aren't running a super up-to-date version of doom.

Relatedly, leaving this in ~packages.el~ so I can just dump the activation code in ~local.el~ if needed.
#+begin_src elisp :tangle packages.el
(package! kkp)
#+end_src

The naive config (for why it's disabled see immediately below):
#+begin_src elisp :tangle no
(use-package! kkp
  :config (global-kkp-mode +1))
#+end_src

The following snipped was added as a test at Henrik's request; it does what I want, and
presumably somehow is better optimized for doom's loading than the above.
#+begin_src elisp tangle no
(add-hook! 'tty-setup-hook :depth -90
  (defun +tty-init-kkp-h ()
    (global-kkp-mode +1)
    (kkp-enable-in-terminal)))
#+end_src
* text editing per se
** text manipulation utilities [0/1]
See the =text manipulation utility macros= appendix for deets.
#+begin_src elisp
<<text-manipulation-metafns>>
#+end_src
*** ~(not-every programming_language({conventionallyUses: "THE_SAME_CASING"}))~
Let's make some helper commands for manipulating the casing of programming symbols. Since
they are defined with ~def-text-transform~, they're usable as elisp string utilities and as
a command on region both.
#+begin_src elisp
(def-text-transform 'kebab-case #'s-dashed-words)
(def-text-transform 'pascal-case #'s-upper-camel-case)
(def-text-transform 'camel-case #'s-lower-camel-case)
(def-text-transform 'snake-case #'s-snake-case)
(def-text-transform 'screaming-snake-case #'(lambda (str) (s-upcase (s-snake-case str))))
(def-text-transform 'lower-words-case #'(lambda (str) (s-join " " (-map #'s-downcase (s-split-words str)))))
#+end_src

*** manipulate numbers at point
#+begin_src elisp
(defun decrement-number-at-point ()
  "Decrement the number at point by 1."
  (interactive)
  (save-excursion
    (skip-chars-backward "0-9")
    (when (looking-at "[0-9]+")
      (let ((num (string-to-number (match-string 0))))
        (replace-match (number-to-string (1- num)))))))

(defun increment-number-at-point ()
  "Increment the number at point by 1."
  (interactive)
  (save-excursion
    (skip-chars-backward "0-9")
    (when (looking-at "[0-9]+")
      (let ((num (string-to-number (match-string 0))))
        (replace-match (number-to-string (1+ num)))))))

(map! :leader
      :desc "decrement at point" "nj" #'decrement-number-at-point
      :desc "increment at point" "nk" #'increment-number-at-point)
#+end_src
** completion
*** built-in completions
Might as well use the more powerful built-in expansion system:
#+begin_src elisp
(map! [remap dabbrev-expand] #'hippie-expand)
#+end_src

*** company-mode
Turns out, I get extremely annoyed when emacs lags because ispell is second-guessing my
writing the english language!
#+begin_src elisp
(setq company-global-modes '(not text-mode org-mode))
#+end_src

** an opinionated mix of the vim and emacs keybinding schemes [0/3]
*** TODO make the long-threatened PR adding a ~+hybrid~ flag to the evil module
This was my first draft, which I think... mostly worked?
#+begin_src diff :tangle no
diff --git a/modules/editor/evil/config.el b/modules/editor/evil/config.el
index db274fab2..344ccf8c0 100644
--- a/modules/editor/evil/config.el
+++ b/modules/editor/evil/config.el
@@ -420,6 +420,9 @@ directives. By default, this only recognizes C directives.")
     "#" #'evil-visualstar/begin-search-backward))


+(when (modulep! +hybrid)
+  (setq! evil-disable-insert-state-bindings t))
+
 ;;
 ;;; Text object plugins

diff --git a/modules/lang/markdown/config.el b/modules/lang/markdown/config.el
index 6602d1339..4bec4c332 100644
--- a/modules/lang/markdown/config.el
+++ b/modules/lang/markdown/config.el
@@ -137,7 +137,8 @@ capture, the end position, and the output buffer.")
         :n "TAB" #'markdown-cycle
         :n [backtab] #'markdown-shifttab
         :i "M-*" #'markdown-insert-list-item
-        :i "M-b" #'markdown-insert-bold
+        (:when (not (modulep! :editor evil +hybrid)) :i "M-b" #'markdown-insert-bold)
+        (:when (modulep! :editor evil +hybrid) :i "M-B" #'markdown-insert-bold)
         :i "M-i" #'markdown-insert-italic
         :i "M-`" #'+markdown/insert-del
         :i "M--" #'markdown-insert-hr
#+end_src

**** TODO are there (still?) load-order problems when running ~(setq! evil-disable-insert-state-bindings t)~ at a normal time (i.e. not hella early)?
I recall (now too vaguely smh) that it only has worked for me when I put that (in a vanilla ~setq~ form) in ~init.el~, but not in ~config.el~. Why?

*** [DEPRECATED] wait, is this split two tmux panes or two emacs windows?
+WHO CARES+

So this used to be my JAM (I mean, just note the account hosting that fork's repo), but
increased usage of vanilla emacs bindings, both in emacs and zsh, eventually lead me to
prefer having =C-k= as ~kill-line~ to having a universal, super-accessible binding for
navigating up a split in all my various terminal contexts. Pour one out, we had a good run.

#+begin_src elisp :tangle no
(package! evil-tmux-navigator
  :recipe (:host github :repo "ambirdsall/evil-tmux-navigator"))
(unpin! evil-tmux-navigator)
#+end_src

#+begin_src elisp :tangle no
(use-package! evil-tmux-navigator
  :config (evil-tmux-navigator-bind-keys))
#+end_src

Now, all elegies aside, I do semi-frequently use my tmux split navigation command (now
=prefix+{h,j,k,l}= rather than =ctrl+{h,j,k,l}=) when I intend to navigate a TUI emacs split.
It would be good to revisit the package in a way that makes it workable with my current
keybinding scheme as well sometime.
*** replace with register
#+begin_src elisp :tangle packages.el
(package! evil-replace-with-register)
#+end_src

#+begin_src elisp
(use-package! evil-replace-with-register
  :init
  (setq evil-replace-with-register-key (kbd "gr"))
  :config (evil-replace-with-register-install))
#+end_src
*** evil-exchange
#+begin_src elisp :tangle packages.el
(package! evil-exchange)
#+end_src

#+begin_src elisp
(use-package! evil-exchange
  :config (evil-exchange-install))
#+end_src
*** matchit
#+begin_src elisp :tangle packages.el
(package! evil-matchit)
#+end_src

#+begin_src elisp
(use-package! evil-matchit
  :config (global-evil-matchit-mode 1))
#+end_src
*** changing up some default settings
#+begin_src elisp
(setq! evil-ex-search-persistent-highlight nil
       +evil-want-o/O-to-continue-comments nil)
#+end_src

You can have my ~evil-substitute~ when you pry it from my cold, dead fingers.
#+begin_src elisp :tangle packages.el
(package! evil-snipe :disable t)
#+end_src

