.config/doom/config.org
*** tab bar :: display workspaces [0/2]
Taken from [[https://discourse.doomemacs.org/t/permanently-display-workspaces-in-the-tab-bar/4088][hylo's discourse post]], thanks hylo.

Notably, clicking on the tabs accomplishes nothing helpful with this setup.
#+begin_src elisp
(custom-set-faces!
  '(+workspace-tab-face :inherit default :family "Overpass" :height 135)
  '(+workspace-tab-selected-face :inherit (highlight +workspace-tab-face)))

(defvar amb/enable-workspace-tabs nil
  "Do I really want to show tabs of the workspace names? Tell me via this variable.")

(after! persp-mode
  (defun workspaces-formatted ()
    ;; fancy version as in screenshot
    (+doom-dashboard--center (frame-width)
                             (let ((names (or persp-names-cache nil))
                                   (current-name (safe-persp-name (get-current-persp))))
                               (mapconcat
                                #'identity
                                (cl-loop for name in names
                                         for i to (length names)
                                         collect
                                         (concat (propertize (format " %d" (1+ i)) 'face
                                                             `(:inherit ,(if (equal current-name name)
                                                                             '+workspace-tab-selected-face
                                                                           '+workspace-tab-face)
                                                               :weight bold))
                                                 (propertize (format " %s " name) 'face
                                                             (if (equal current-name name)
                                                                 '+workspace-tab-selected-face
                                                               '+workspace-tab-face))))
                                " "))))
  (defun amb/invisible-current-workspace ()
    "The tab bar doesn't update when only faces change (i.e. the
current workspace), so we invisibly print the current workspace
name as well to trigger updates"
    (propertize (safe-persp-name (get-current-persp)) 'invisible t))

  (customize-set-variable 'tab-bar-format '(workspaces-formatted tab-bar-format-align-right amb/invisible-current-workspace))

  ;; don't show current workspaces when we switch, since we always see them
  (advice-add #'+workspace/display :override #'ignore)
  ;; same for renaming and deleting (and saving, but oh well)
  (advice-add #'+workspace-message :override #'ignore)

  ;; need to run this later for it to not break frame size for some reason
  (run-at-time
   nil
   nil
   (cmd!
    (when amb/enable-workspace-tabs
      (tab-bar-history-mode)
      (tab-bar-mode +1)))))

#+end_src

This one is no better, but it /is/ simpler. Perhaps it's a better starting point for making a clickable version?
#+begin_src elisp :tangle no
(after! persp-mode
  ;; alternative, non-fancy version which only centers the output of +workspace--tabline
  (defun workspaces-formatted ()
    (+doom-dashboard--center (frame-width) (+workspace--tabline)))

  (defun hy/invisible-current-workspace ()
    "The tab bar doesn't update when only faces change (i.e. the
current workspace), so we invisibly print the current workspace
name as well to trigger updates"
    (propertize (safe-persp-name (get-current-persp)) 'invisible t))

  (customize-set-variable 'tab-bar-format '(workspaces-formatted tab-bar-format-align-right hy/invisible-current-workspace))

  ;; don't show current workspaces when we switch, since we always see them
  (advice-add #'+workspace/display :override #'ignore)
  ;; same for renaming and deleting (and saving, but oh well)
  (advice-add #'+workspace-message :override #'ignore))

;; need to run this later for it to not break frame size for some reason
(run-at-time nil nil (cmd! (tab-bar-mode +1)))
#+end_src

Having made this nice tab bar, we need a way to toggle it: some modes (notably PDFView)
have rendering logic that doesn't play nicely with (or is not properly aware of) the tab
bar.

#+begin_src elisp
(map! :leader
      :desc "toggle tab bar" "tT" #'tab-bar-mode)
#+end_src

**** TODO Mouse click bindings for the tab bar
A normal click on a tab navigates to it (optionally, if not the current one). Right clicking brings up a menu of nice things to be able to do.

**** TODO PDFView mode does not take tab bar height into account when rendering a page
The end result is having to scroll a small amount whenever I (\*Bob Seger voice*) turn the
page, which is frankly a bit annoying. A shitty workaround is to manually toggle, I guess.
*** window sizing
This is a nice little thing:
#+begin_src elisp :tangle packages.el
(package! golden-ratio)
#+end_src

It's automatic resizing behavior is overkill, but it's nice to be able to easily opt-in:
#+begin_src elisp
(use-package! golden-ratio
  :config
  (map! :leader "wG" #'golden-ratio))
#+end_src

So. Sometimes the current window just needs to be a little more. Let's make that situation nice and easy to handle:
#+begin_src elisp
(defvar amb--more-current-window-original-sizes (make-hash-table :test 'eq)
  "A hash table storing the original sizes of windows so they can be restored by `amb/more-current-window'.")

(defun amb--more-current-window-save-original-size (win)
  "Ensure the window configuration relative to a window object `WIN' is stored.
Window sizes are stored in `amb--more-current-window-original-sizes'."
  (unless (gethash win amb--more-current-window-original-sizes)
    (puthash win (current-window-configuration) amb--more-current-window-original-sizes)))

(defun amb/more-current-window ()
  "Make the current window larger based on predefined breakpoints.
If the window occupies the entire frame, restore its original size."
  (interactive)
  (let* ((win (selected-window))
         (frame-width (frame-width))
         (window-width (window-total-width win)))
    (cond
     ;; If the window is maximized, restore its original size.
     ((and (window-full-width-p win) (window-full-height-p win))
      (message "there and, uh,")
      (when-let ((orig-size (gethash win amb--more-current-window-original-sizes)))
        (message "and back again")
        (set-window-configuration orig-size)
        (remhash win amb--more-current-window-original-sizes)))
     ;; If the width is less than 50% of the frame, increase it to 50%.
     ;; Yes, I compare against 48%, not 50%; I don't want to be stuck at 50% when I want *more*
     ((< (/ (float window-width) frame-width) 0.48)
      (message "fiddy")
      (amb--more-current-window-save-original-size win)
      (let ((target-width (floor (* 0.50 frame-width))))
        (adjust-window-trailing-edge win (- target-width window-width) t)))
     ;; If the width is less than 61% of the frame, use golden-ratio.
     ((< (/ (float window-width) frame-width) 0.61)
      (message "goldy")
      (amb--more-current-window-save-original-size win)
      (call-interactively #'golden-ratio))
     ;; If the width is less than 70%, enlarge the window.
     ((< (/ (float window-width) frame-width) 0.70)
      (message "biggie")
      (amb--more-current-window-save-original-size win)
      (doom/window-enlargen))
     ;; Otherwise, maximize the window.
     (t
      (message "all that and then some")
      (amb--more-current-window-save-original-size win)
      (doom/window-maximize-buffer)))))

;; Bind the command to the leader key.
(map! :leader
      :desc "more of current window"
      "wM" #'amb/more-current-window)
#+end_src

* programming
** Indent however you wish, as long as you do it right
#+begin_src elisp
(setq standard-indent 2)
#+end_src

** projectile
#+begin_src elisp
(setq! projectile-project-search-path '("~/c/"))
#+end_src

*** every project has a =todo.org= and every =todo.org= can just be hardlinks of the same underlying file
This pair of variables is required to let you open the same hardlinked todo.org inode in multiple
project-specific locations in the filesystem, and have each maintain its local context (e.g. when
running projectile functions acting on what filesystem heuristics see as the surrounding VC
project). It's an idiosyncratic pattern, but it works brilliantly for me on work computers.

#+begin_src elisp
(setq! find-file-existing-other-name nil
       find-file-visit-truename nil)

(after! projectile
  (defun amb/goto-project-todos ()
    (interactive)
    ;; TODO dynamically create one if missing? This system can be improved further.
    (find-file (concat (projectile-project-root) "todo.org")))

  (map!
   :leader
   :desc "Open project TODOs.org file" "po" #'amb/goto-project-todos)

  (add-to-list 'projectile-globally-ignored-files "!todo.org")
  (add-to-list 'projectile-globally-ignored-files "!test.http"))
#+end_src

** code compass
#+begin_src elisp :tangle packages.el
(package! code-compass
  :recipe (:host github :repo "ag91/code-compass" :files (:defaults "pages" "scripts")))
#+end_src

#+begin_src elisp
(use-package! code-compass :defer t
              :commands (c/show-hotspots-sync
                         c/show-hotspot-snapshot-sync
                         c/show-code-churn-sync
                         c/show-coupling-graph-sync
                         c/show-code-communication-sync
                         c/show-knowledge-graph-sync
                         c/show-code-age-sync
                         c/show-fragmentation-sync
                         c/show-hotspot-cluster-sync)
              :config
              (setq c/exclude-directories (list "node_modules" "bower_components" "vendor" "tmp" "images"))
              (if IS-MAC (setq c/preferred-browser "open")))
#+end_src
** tree sitter
#+begin_src elisp
(setq treesit-language-source-alist
   '((bash "https://github.com/tree-sitter/tree-sitter-bash")
     (cmake "https://github.com/uyha/tree-sitter-cmake")
     (css "https://github.com/tree-sitter/tree-sitter-css")
     (elisp "https://github.com/Wilfred/tree-sitter-elisp")
     (go "https://github.com/tree-sitter/tree-sitter-go")
     (html "https://github.com/tree-sitter/tree-sitter-html")
     (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
     (json "https://github.com/tree-sitter/tree-sitter-json")
     (make "https://github.com/alemuller/tree-sitter-make")
     (markdown "https://github.com/ikatyang/tree-sitter-markdown")
     (python "https://github.com/tree-sitter/tree-sitter-python")
     (toml "https://github.com/tree-sitter/tree-sitter-toml")
     (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
     (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
     (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
#+end_src

here's a snippet to install you some language libraries
#+begin_src elisp :tangle no
(mapc #'treesit-install-language-grammar
      (mapcar #'car treesit-language-source-alist))
#+end_src
