.config/doom/config.org
** non-language-specific IDE shit [0/5]
The gold standard for LSP is VSCode; this goes triply for web development, which uh ✷checks notes✷ is my job.

This is organized by features and is an exercise in aspiration-driven development.  Each
key feature gets a subtree to hold code and/or working notes (an empty subtree for a
desirable feature is better than nothing), and incrementally, over time, I'll muddle my
way through the sea of TODOs and Wouldn't It Be Nices into a future of shininess and feature parity.
Because if I can get /that/, along with all of emacs' land before time shit, I'll be cooking
with fire.

*** TODO LSP actions: code actions, restarting a freaking out server, etc (WHY NOT RUNNING THO)
Auto-imports are handled by code actions; there's a function for that. It uses a vertico
buffer instead of a pop-up, presumably via ~completing-read~, but frankly that's better.
#+begin_src elisp
(after! lsp-mode
  (defun amb/lsp-restart ()
    "The current lsp server? Turn it off and on again."
    (interactive)
    (lsp-disconnect)
    (lsp!))

  (defun amb/lsp-execute-code-action-if-you-are-into-that ()
    "Like lsp-execute-code-action, but in cases where there is only a single available
  action it asks for confirmation rather than unconditionally springing into action."
    ;; TODO implement the logic as described lol
    (call-interactively #'lsp-execute-code-action))

  (defun amb/lsp-dwim ()
    "If there are code actions at point, trigger that. If not, jump to definition."
    (interactive)
    (if (lsp-code-actions-at-point)
        (amb/lsp-execute-code-action-if-you-are-into-that)
      (call-interactively #'+lookup/definition)))

  (map!
   :gnvie "C-M-l" #'lsp-execute-code-action
   (:map lsp-mode-map :n "RET" #'amb/lsp-dwim)

  ;; but, like, it *is* a prefix key???
  ;; manually running this map! form after init works great; I suppose lsp module does some rebinding or some shit
  ;; (map! :leader :desc "restart server" "clR" #'amb/lsp-restart)
  ))

(after! lsp-ui
  (map!
   :leader :desc "show references" "cR" #'lsp-ui-peek-find-references))
#+end_src

I'm not sure about the keybindings. Maybe an extra top-level normal mode command?

**** TODO auto-inserted imports should be organized per project-local eslint rules

*** TODO Actions at point hydra with =<leader>c.=

#+begin_src elisp :tangle no
(defun ide-shit-at-point ()
  (interactive)
  (message "idk, read up on hydras?"))

(map!
 :leader "c." #'ide-shit-at-point)
#+end_src

**** TODO what are the lsp things I want?
| I want to...                       | command                    | key |
|------------------------------------+----------------------------+-----|
| display type                       | ~+lookup/type-definition~    | t   |
| insert inferred type               | [none, it's a code action] | T   |
| rename symbol                      | ~lsp-rename~                 | r   |
| display references                 | ~+lookup/references~         | u   |
| jump to definition                 | ~+lookup/definition~         | d   |
| ⋆waves hands vaguely⋆ code actions | ~lsp-execute-code-action~    | a   |
**** TODO how do I make a hydra again

** the four most frustrating words in the english language: web development in emacs [0/1]
First two sections largely +yoinked from+ courtesy of https://codeberg.org/ckruse/doom.d/src/commit/c6c7163e79a0fecdda6df9e81e60dc246170213a/config.el
*** {t,j}s
#+begin_src elisp :tangle (and "packages.el" "no")
(package! tsi :recipe (:type git :host github :repo "orzechowskid/tsi.el"))
(package! tsx-mode :recipe (:type git :host github :repo "orzechowskid/tsx-mode.el"))
#+end_src

#+begin_src elisp :tangle no
(setq typescript-indent-level 2
      js-indent-level 2)

(use-package! tsx-mode
  :mode (("\\.tsx\\'" . tsx-mode))
  :hook (tsx-mode . lsp!)
  :hook (tsx-mode . rainbow-delimiters-mode)
  :hook (tsx-mode . add-node-modules-path)
  :custom (tsx-mode-tsx-auto-tags  t)
  :defer t
  :init
  (after! flycheck
    (flycheck-add-mode 'javascript-eslint 'tsx-mode))

  (add-hook! 'tsx-mode-hook
    (defun ck/tsx-setup ()
      (flycheck-select-checker 'javascript-eslint)
      (flycheck-add-next-checker 'javascript-eslint 'lsp)
      (pushnew! flycheck-disabled-checkers
                'javascript-jshint
                'tsx-tide
                'jsx-tide)))
#+end_src

*** prettier et al with apheleia (disabled for testing now that elken's module has dropped)
#+begin_src elisp :tangle (or "no" "packages.el")
(package! apheleia)
#+end_src

#+begin_src elisp :tangle no
(use-package! apheleia
  :hook ((tsx-mode . apheleia-mode)
         (typescript-mode . apheleia-mode)
         (typescript-tsx-mode . apheleia-mode)
         (js-mode . apheleia-mode)
         (json-mode . apheleia-mode)
         (css-mode . apheleia-mode)
         (scss-mode . apheleia-mode))
  :defer t
  :config
  (push '(tsx-mode . prettier) apheleia-mode-alist)
  (push '(scss-mode . prettier) apheleia-mode-alist)
  (push '(css-mode . prettier) apheleia-mode-alist))
#+end_src

*** web-mode
#+begin_src elisp
(setq! web-mode-markup-indent-offset 2
       web-mode-css-indent-offset 2
       web-mode-code-indent-offset 2)

(setq! web-mode-engines-alist
       '(;("angular" . "\\.html")
         ("vue" . "\\.vue")
         ("phoenix" . "\\.html\\.eex")
         ("erb" . "\\.html\\.erb")))
#+end_src

*** TODO vue
Meanwhile, this little sucker is just _sitting_ in =custom.el=, hideous. This must be improved.
#+begin_quote
'(auto-insert-alist
'((("\\.vue\\'" . "Vue component")
.
["template.vue" web-mode autoinsert-yas-expand])))
#+end_quote

*** tailwindcss
#+begin_src elisp :tangle packages.el
(package! lsp-tailwindcss :recipe (:host github :repo "merrickluo/lsp-tailwindcss"))
#+end_src

#+begin_src elisp
(use-package! lsp-tailwindcss
  :after lsp)
#+end_src
** there are more languages under the sun than ~:lang~ can speak [0/3]
*** python
**** debugger support, at least in theory
#+begin_src elisp
(after! dap-mode
  (setq dap-python-debugger 'debugpy))
#+end_src
**** TODO use ~python-ts-mode~ by default
**** fold all methods in a class body
- does this need to be python-only? no.
#+begin_src elisp
(after! tree-sitter-langs
  (defun fold-all-methods-in-class ()
    "Fold all methods within the current class in any Tree-sitter-enabled buffer."
    (interactive)
    (let* ((root-node (tsc-root-node tree-sitter-tree))
           (query (tsc-make-query
                   tree-sitter-language
                   "
                 (class_definition
                   body: (block
                     [
                       (function_definition
                         name: (identifier) @method-name
                         body: (block) @method-body)
                       (decorated_definition
                         definition: (function_definition
                           name: (identifier) @method-name
                           body: (block) @method-body))
                     ]
                   ))
                 "))
           (captures (tsc-query-captures query root-node #'tsc--buffer-input)))
      (dotimes (i (length captures))
        (let* ((capture (aref captures i))
               (capture-name (car capture))
               (capture-node (cdr capture)))
          (when (string= capture-name "method-name")
            (save-excursion
              (goto-char (tsc-node-start-position capture-node))
              (+fold/close))))))))
#+end_src

*** TODO is this fennel config needed now that ~(doom! :lang (lua +fennel))~ exists?
#+begin_src elisp :tangle packages.el
(package! fennel-mode)
#+end_src

#+begin_src elisp
(use-package! fennel-mode
  :config (add-to-list 'auto-mode-alist '("\\.fnl\\'" . fennel-mode)))
#+end_src
*** graphql
#+begin_src elisp :tangle packages.el
(package! graphql-mode)
#+end_src

#+begin_src elisp
(use-package! graphql-mode)
#+end_src
*** elixir
#+begin_src elisp
(after! alchemist-mode
  (map! (:when (modulep! :lang elixir)    ; local conditional
          (:map alchemist-mode-map
           :localleader
           "tt" #'exunit-toggle-file-and-test
           "tT" #'exunit-toggle-file-and-test-other-window))))

#+end_src
*** yuck
#+begin_src elisp :tangle packages.el
(package! yuck-mode)
#+end_src
*** scheme, or: you've got gall, you've got guile [0/1]
Apologies to racket, which is a nicer language per se, but guile's already got its grubby
little +mitts+ C ABI in lots of interesting parts of the linux ecosystem and I just don't
have time to shop around. If the list stored at ~geiser-active-implementations~ has length >
1, then every time I restart emacs, I'll be prompted to choose which implementation to
associate with every. single. scheme. buffer. that. I. have. ever. opened. in. my. life.
It gets old fast:
#+begin_src elisp
(setq! geiser-active-implementations '(guile))
#+end_src

Guile's shebang convention is surprisingly well-considered from first principles, in terms
of how it relates to the rest of the language syntax and being a good cross-platform
citizen. It's also weird, complex, and idiosyncratic, and I am apparently incapable of
remembering it.

#+begin_src elisp
(defun insert-guile-shebang ()
  (interactive)
  (save-excursion
    (beginning-of-buffer)
    (insert "#!/usr/local/bin/guile \\
-e main -s
!#

")))
#+end_src

**** TODO move this to =~/.config/guile/config.org= :: pimp my +ride+ .guile
This is my guile repl config. Let's frontload the potentially confusing bit: I would like to rely on the [[https://gitlab.com/NalaGinrut/guile-colorized][guile-colorized]] library, which
is
a) a lovely little quality-of-life improvement, and
b) not packaged with the language

This adds up to a bit of a hassle if one's aim is a config which can be dropped into
different computers and operating systems. My path through the thicket (as of now) is to
add an elisp snippet which shells out to guile to check whether the ~(ice-9 colorized)~
module can be found in the load path; this lets me conditionally tangle the appropriate
version of =~/.guile= accordingly.

Most config is defined outside the conditional top-level src blocks in noweb cookies to
keep things DRY and maintainable.

***** augment load path
#+name: guile-augment-load-path
#+begin_src guile :tangle no
(add-to-load-path (string-append (getenv "HOME") "/lib/scheme"))
#+end_src

***** shared modules
The first line here has ugly indentation so the corresponding noweb cookie (or whatever
the term is) in the source blocks that actually get tangled to =.guile= files can have
pretty indentation.
#+name: guile-shared-modules
#+begin_src guile :tangle no
 (oop goops)
 (srfi srfi-1)
 (srfi srfi-26) ;; cut
 (ice-9 match)
 (ice-9 readline)
#+end_src

***** setup repl
#+name: guile-setup-repl
#+begin_src guile :tangle no
(activate-readline)
#+end_src

***** conditional file templates
#+begin_src guile :noweb yes :tangle (if (string-equal "exists" (shell-command-to-string "test -e `guile -c \"(display (string-append (car %load-path) \\\"/ice-9/colorized.scm\\\"))\"` && echo -n exists")) "~/.guile" "no")
<<guile-augment-load-path>>

(use-modules
 <<guile-shared-modules>>
 (ice-9 colorized))

 <guile-setup-repl>>
(activate-colorized)
#+end_src

But installing a special guile lib and running its (rather manual) installation
process is annoying; until I properly automate it in [[file:~/Makefile][my dotfiles' Makefile]], a
hideously copy-pasted near-duplicate will have to do.
#+begin_src guile :noweb yes :tangle (if (not (string-equal "exists" (shell-command-to-string "test -e `guile -c \"(display (string-append (car %load-path) \\\"/ice-9/colorized.scm\\\"))\"` && echo -n exists"))) "~/.guile" "no")
<<guile-augment-load-path>>

(use-modules
 <<guile-shared-modules>>)

<<guile-setup-repl>>
#+end_src
*** yaml
#+begin_src elisp :tangle packages.el
(package! yaml-pro)
#+end_src

#+begin_src elisp
(use-package! yaml-pro
  :hook (yaml-mode . yaml-pro-mode)
  :hook (yaml-mode . yaml-pro-ts-mode)
  )
#+end_src

This was my OG config; it is not as nice as using a hook, and doesn't use the
tree-sitter-enabled version of ~yaml-pro-mode~. Here for reference, and because the
tree-sitter version requires a semi-manual setup step to install all the language servers.
#+begin_src elisp :tangle no
(use-package! yaml-pro
  :config (add-to-list 'auto-mode-alist '("\\.ya?ml'" . yaml-pro-mode)))
#+end_src
** "I hear lisp is good for AI"
*** copilot
#+begin_src elisp :tangle "packages.el"
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
#+end_src

#+begin_src elisp
;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion-by-word)
              ("TAB" . 'copilot-accept-completion-by-word)
              ("C-TAB" . 'copilot-accept-completion)
              ("C-<tab>" . 'copilot-accept-completion)))
#+end_src
