.config/doom/config.org
*** chatGPT
#+begin_src elisp :tangle packages.el
(package! gptel)
#+end_src

#+begin_src elisp
(use-package! gptel)
#+end_src

* {ma,}git
With apologies to vc-mode, magit is the gold standard. So:
#+begin_src elisp :noweb yes
(after! magit
  <<magit-window-management>>

  <<magit-auto-dash>>

  <<magit-sections>>

  <<magit-custom-actions>>

  <<magithub>>)
#+end_src

Not all the following config has to do with magit, but when it does, it gets tangled into
that ~after!~ form.


** magit status, like the cat in the hat, should clean up after itself
These are fine to set before magit is initialized, so they are directly tangled instead of injected into the ~after!~  block with noweb shenanigans.
#+begin_src elisp :tangle no :noweb-ref magit-window-management
  ;; strictly speaking unnecessary (it's the default)
  ;; (add-hook 'magit-pre-display-buffer-hook #'magit-save-window-configuration)
  (setq magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1)
  (setq magit-bury-buffer-function #'magit-restore-window-configuration)
#+end_src

** If I can't type a space, why let me?
In scenarios like branch names, whitespace is disallowed. But using the spacebar as a word
separator is deep, deep muscle memory. Why fight it?
#+begin_src elisp :tangle no :noweb-ref magit-auto-dash
  (defun just-use-a-dash-instead-sheesh (_nope &rest _dontcare)
    (interactive)
    (self-insert-command 1 ?-))

  (advice-add 'magit-whitespace-disallowed :around #'just-use-a-dash-instead-sheesh)
#+end_src

** magit-status sections
#+begin_src elisp :tangle no :noweb-ref magit-sections
(setq! magit-section-initial-visibility-alist '((stashes . show) (commits . show)))
#+end_src

** custom actions in magit transients
#+begin_src elisp :tangle no :noweb-ref magit-custom-actions
(defun amb/magit-checkout-default-branch ()
  "Check out the default branch of the current repository."
  (interactive)
  (let ((default-branch (magit-git-string "rev-parse" "--abbrev-ref" "origin/HEAD")))
    (when default-branch
      ;; Strip the 'origin/' part from the branch name
      (let ((branch (replace-regexp-in-string "^origin/" "" default-branch)))
        ;; Checkout the branch using Magit
        (magit--checkout branch)
        (magit-refresh)))))

(transient-append-suffix 'magit-branch "b"
  '("M" "default branch" amb/magit-checkout-default-branch))
#+end_src

** dotfiles
I manage my dotfiles with a bare git repository; this takes a little extra effort to set
up properly. With a hat tip to [[https://github.com/hylophile/.files/blob/d2d41871bd6a74e4b55fadf44d46613d0bcacb53/.config/doom/config.org#dotfiles][hylo]], from whom much of this is adapted.

The song-and-dance is a two-step:
1) open ~magit-status~ for ~~/~ if no orthodox git repo can be found
2) advise ~magit-process-environment~ to set up the correct, unmatched values for ~GIT_WORK_TREE~ and ~GIT_DIR~ if and only if we're getting the status for the ~~/~ repo.

#+begin_src elisp
(defun amb/magit-status-with-dotfiles-fallback ()
  (interactive)
  (if (magit-gitdir)
      (magit-status)
    (magit-status "~/")))

(map! :after magit :leader "g g" #'amb/magit-status-with-dotfiles-fallback)

;; from https://github.com/magit/magit/issues/460

(defun amb/magit-process-environment (env)
  "Add GIT_DIR and GIT_WORK_TREE to ENV when in a special directory."
  (let ((here (file-name-as-directory (expand-file-name default-directory)))
        (home (expand-file-name "~/")))
    (when (string= here home)
      (let ((gitdir (expand-file-name "~/.dots/")))
        (push (format "GIT_WORK_TREE=%s" home) env)
        (push (format "GIT_DIR=%s" gitdir) env))))
  env)

(advice-add 'magit-process-environment
            :filter-return #'amb/magit-process-environment)
#+end_src

This works for almost everything, but there's not yet a good way to stage new files in the
dotfiles repo. So:
#+begin_src elisp
(defun amb/magit-stage-file ()
  (interactive)
  (if (magit-gitdir)
      (call-interactively #'magit-stage-file)
      (shell-command (concat
                      "git --git-dir=$HOME/.dots/ --work-tree=$HOME add "
                      (buffer-file-name))
                     t)))

(map! :after magit :leader "g S" #'amb/magit-stage-file)
#+end_src

I also have to hide my dotfiles away from projectile to avoid caching /way/ too many files
in ~~/~ (until magit can handle separate work trees) properly: Doom recognizes my home
directory as a git dir, but it doesn't find any of its config whatsoever, which can cause
projectile to act silly when it can't find an intermediate project root (either because of
error or because I used the wrong muscle memory).

#+begin_src elisp :tangle no
(after! projectile (setq projectile-project-root-files-bottom-up (remove ".git"
projectile-project-root-files-bottom-up)))

(defun amb/projectile-find-file ()
  (interactive)
  (if (equal (expand-file-name "~/") (projectile-project-root))
    (call-interactively #'find-file)
    (projectile-find-file)))

(map! :leader "SPC" #'amb/projectile-find-file)
#+end_src
** nice git conflic resolution hydra
Gold standard, yes, but not be all and end all. This defines a nice hydra for working with
files containing git conflicts.

#+begin_src elisp
;; all thanks and apologies to https://github.com/alphapapa/unpackaged.el
(use-package! smerge-mode
  :after (hydra magit)
  :config
  (defhydra amb/smerge-hydra
    (:color pink :hint nil :post (smerge-auto-leave))
    "
^Move^       ^Keep^               ^Diff^                 ^Other^
^^-----------^^-------------------^^---------------------^^-------
_n_ext       _b_ase               _<_: upper/base        _C_ombine
_p_rev       _u_pper              _=_: upper/lower       _r_esolve
^^           _l_ower              _>_: base/lower        _k_ill current
^^           _a_ll                _R_efine
^^           _RET_: current       _E_diff
"
    ("n" smerge-next)
    ("p" smerge-prev)
    ("b" smerge-keep-base)
    ("u" smerge-keep-upper)
    ("l" smerge-keep-lower)
    ("a" smerge-keep-all)
    ("RET" smerge-keep-current)
    ("\C-m" smerge-keep-current)
    ("<" smerge-diff-base-upper)
    ("=" smerge-diff-upper-lower)
    (">" smerge-diff-base-lower)
    ("R" smerge-refine)
    ("E" smerge-ediff)
    ("C" smerge-combine-with-next)
    ("r" smerge-resolve)
    ("k" smerge-kill-current)
    ("ZZ" (lambda ()
            (interactive)
            (save-buffer)
            (bury-buffer))
     "Save and bury buffer" :color blue)
    ("q" nil "cancel" :color blue))
  (map! :leader :desc "resolve git conflicts" "gm" #'amb/smerge-hydra/body)
  :hook (magit-diff-visit-file . (lambda ()
                                   (when smerge-mode
                                     (amb/smerge-hydra/body)))))
#+end_src

** working with github
#+begin_src elisp :tangle no :noweb-ref magithub
(defun amb/copy-github-permalink ()
  "Generate a GitHub permalink for the current file at the current revision (full SHA).
If a region is active, link to the highlighted line(s)."
  (interactive)
  (let* ((remote-url (magit-get "remote" (magit-get-remote) "url"))
         (repo-url (replace-regexp-in-string
                    (rx string-start
                        "git@"
                        (group (+ (not (any ":")))) ; match domain
                        ":"
                        (group (+ (not (any "."))))
                        (optional ".git")
                        string-end)
                    "https://\\1/\\2" remote-url))
         (full-sha (magit-rev-parse "HEAD"))
         (file-path (magit-file-relative-name buffer-file-name))
         (start-line (line-number-at-pos (region-beginning)))
         (end-line (line-number-at-pos (region-end)))
         (lines (if (use-region-p)
                    (if (= start-line end-line)
                        (format "#L%d" start-line)
                      (format "#L%d-L%d" start-line end-line))
                  ""))
         (permalink (format "%s/blob/%s/%s%s" repo-url full-sha file-path lines)))
    (copy-to-clipboard permalink)
    (message "GitHub permalink: %s" permalink)))
#+end_src

* info-mode, or: RTFM
#+begin_src elisp
(add-to-list '+evil-collection-disabled-list 'info)
(set-evil-initial-state! 'info-mode 'emacs)

(map! :map 'info-mode-map
      "j" #'next-line
      "k" #'previous-line)
#+end_src
* org-mode config [0/1]
** drop it in a box
Notes must be at hand to be helpful, ideally on any of several computers:
#+begin_src elisp
(let ((dir "~/Dropbox/org/"))
  (and (file-exists-p dir)
       (setq org-directory dir)))
#+end_src

** make org-mode act nicer
#+begin_src elisp
(setq! org-log-into-drawer t
       org-hierarchical-todo-statistics nil
       org-refile-use-outline-path 'full-file-path
       org-todo-keywords '((sequence "NEXT(n)" "TODO(t)" "BLOCKED(b)" "SOMEDAY(s)" "PROJ(p)" "QUESTION(q)" "|" "DONE(d)" "CANCELLED(c)")))
#+end_src

** make org-mode look nicer
#+begin_src elisp
(custom-set-faces!
  '(outline-1 :weight extra-bold :height 1.25)
  '(outline-2 :weight bold :height 1.15)
  '(outline-3 :weight bold :height 1.12)
  '(outline-4 :weight semi-bold :height 1.09)
  '(outline-5 :weight semi-bold :height 1.06)
  '(outline-6 :weight semi-bold :height 1.03)
  '(outline-8 :weight semi-bold)
  '(outline-9 :weight semi-bold))

(setq!
 org-hide-emphasis-markers t
 org-agenda-filter-preset '("-quotidian"))

(add-hook! (org-mode) (org-appear-mode 1))
#+end_src

** roam
First, I need a roam directory to serve as the "slipbox":
#+begin_src elisp
(setq org-roam-directory "~/Dropbox/roam/")
#+end_src

I'd like a pretty and interactive graph visualization, too, while I'm at it:
#+begin_src elisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

Org-roam-ui tries to keep up with the latest features of org-roam, which conflicts with Doom Emacs's desire for stability. To make sure nothing breaks, use the latest version of org-roam by unpinning it:
#+begin_src elisp :tangle packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

